Examinator/src/Catalogs/ШаблоныСообщенийСУО/ШаблоныСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСообщенийСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблоновСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Переменные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПеременные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ШаблоныСообщенийСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция Переменные(Знач ШаблонСообщений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщенийСУОПеременные.Переменная КАК Переменная,
		|	NULL КАК ИмяПеременной
		|ИЗ
		|	Справочник.ШаблоныСообщенийСУО.Переменные КАК ШаблоныСообщенийСУОПеременные
		|ГДЕ
		|	ШаблоныСообщенийСУОПеременные.Ссылка = &ШаблонСообщений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШаблоныСообщенийСУОДополнительныеПеременные.Переменная,
		|	ШаблоныСообщенийСУОДополнительныеПеременные.ИмяПеременной
		|ИЗ
		|	Справочник.ШаблоныСообщенийСУО.ДополнительныеПеременные КАК ШаблоныСообщенийСУОДополнительныеПеременные
		|ГДЕ
		|	ШаблоныСообщенийСУОДополнительныеПеременные.Ссылка = &ШаблонСообщений";
	
	Запрос.УстановитьПараметр("ШаблонСообщений", ШаблонСообщений);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
